#+TITLE: Readability metric based on analysis of lexical variety
#+AUTHOR: Roland Coeurjoly
#+EMAIL: rolandcoeurjoly@gmail.com
#+Date:
#+OPTIONS: ^:nil toc:nil H:4
#+LATEX_HEADER: \usepackage{tikz}
#+LATEX_HEADER: \usepackage{attrib}
#+LATEX_HEADER: \Plainauthor{Roland Coeurjoly}
#+LATEX_HEADER: \author{Roland Coeurjoly}
#+LATEX_HEADER: \title{Readability metric based on analysis of lexical variety}
#+LATEX_HEADER: \Shorttitle{Pending}
#+LATEX_HEADER: \Keywords{readability metric, readability test, readability, formula, comprehensible input, extensive reading, vocabulary, literate programming, reproducible research, emacs}
#+LATEX_HEADER: \Address{Pending}
#+LATEX_HEADER: \Abstract{We present a readability metric, capable of being applied to books written in multiple languages and easy to compute, therefore lending itself to be applied to large corpora composed of thousands of books. It uses length of text (metricd in words) versus unique words to compute the rate at which the author introduces new vocabulary in a certain book. This rate can then be used to rank the book with respect to others. This readability metric is only suitable to texts of at least 10.000 (ten thousand) words. It is therefore used primarely for the analysis of }
#+STARTUP: oddeven
** Chinese
The following is the perfect script for downloading Chinese books from haodoo (好讀).
It removes those in vertical format with -R "V*.epub".
  #+BEGIN_SRC shell :exports code :tangle chinese-corpus.sh
wget -np -P $1 -r -A .epub -R "V*.epub" http://haodoo.net/PDB/
  #+END_SRC

#+BEGIN_SRC shell :exports code
find ~/readability-metric/corpus/Chinese/haodoo.net/PDB/ -mindepth 1 -type f -name "*.epub" -exec printf x \; | wc -c
#+END_SRC

#+RESULTS:
: 3699

#+BEGIN_SRC shell :exports code
ls -ltu ~/readability-metric/corpus/Chinese/haodoo.net/PDB/A/*435.epub
#+END_SRC

#+RESULTS:
: -rw-rw-r-- 1 rcl rcl 130460 jul 19 16:04 /home/rcl/readability-metric/corpus/Chinese/haodoo.net/PDB/A/435.epub
** Vocabulary coverage
   #+NAME: vocabulary_coverage
   #+begin_src python :noweb yes :exports code :session sahj :tangle vocabulary_coverage.py :results output
'''
Random
'''
from nltk import FreqDist
import corpus_analysis


MY_BOOK = corpus_analysis.Book("./test/pinocchio.epub")
MY_BOOK.tokenize()
MY_FREQDIST = FreqDist(MY_BOOK.tokens)
print MY_BOOK.word_count
percentage = 0
cumulative_word_count = 0
coverage = 1
print MY_FREQDIST.most_common(coverage)[coverage - 1][1]
margin_unknowable_list = MY_FREQDIST.most_common(MY_BOOK.word_count - 1) - MY_FREQDIST.most_common(int(round((MY_BOOK.word_count - 1)*0.98)))
last_word_frequency = MY_FREQDIST.most_common(coverage)[coverage - 1][1]
coverage += 1
cumulative_word_count += last_word_frequency
percentage = (cumulative_word_count*100/MY_BOOK.word_count)
print margin_unknowable_list
   #+end_src

   #+RESULTS: vocabulary_coverage
   : 52544
   : 3345
   : Traceback (most recent call last):
   :   File "<stdin>", line 1, in <module>
   :   File "/tmp/babel-2FdH2m/python-VLLu9V", line 16, in <module>
   :     margin_unknowable_list = MY_FREQDIST.most_common(MY_BOOK.word_count - 1) - MY_FREQDIST.most_common(int(round((MY_BOOK.word_count - 1)*0.98)))
   : TypeError: unsupported operand type(s) for -: 'list' and 'list'

*** Whole length
#+NAME: moby
#+BEGIN_SRC python :exports code :session readability_metric :results output
from corpus_analysis import Book

moby_dick = Book("test/moby.epub")
moby_dick.extract_text()
moby_dick.tokenize()
print moby_dick.title
with open('moby.tsv', 'w+') as my_file:
    my_file.write(str(moby_dick.word_count) + "\t" + str(moby_dick.unique_words) + "\n")
#+END_SRC

#+RESULTS: moby
: Moby Dick; Or, The Whale

#+NAME: pinocchio
#+BEGIN_SRC python :exports code :session readability_metric :results output
from corpus_analysis import Book

pinocchio = Book("test/pinocchio.epub")
pinocchio.extract_text()
pinocchio.tokenize()
print pinocchio.title

with open('pinocchio.tsv', 'w') as my_file:
    my_file.write(str(pinocchio.word_count) + "\t" + str(pinocchio.unique_words) + "\n")
#+END_SRC
#+RESULTS: pinocchio
: The Adventures of Pinocchio
*** Sweep
#+NAME: moby_sweep
#+BEGIN_SRC python :exports code :session readability_metric :results output
from corpus_analysis import Book

moby_dick = Book("test/moby.epub")
moby_dick.extract_text()
moby_dick.tokenize()
print moby_dick.title
sweep_values = lexical_sweep(moby_dick.tokens, samples=100, log_x=False, log_y=False)
with open('moby_sweep.tsv', 'w') as my_file:
    for sweep_value in sweep_values:
        my_file.write(str(sweep_value[0]) + "\t" + str(sweep_value[1]) + "\n")
#+END_SRC

#+RESULTS: moby_sweep
: Moby Dick; Or, The Whale

#+NAME: pinocchio_sweep
#+BEGIN_SRC python :exports code :session readability_metric :results output
from corpus_analysis import Book, lexical_sweep

pinocchio = Book("test/pinocchio.epub")
pinocchio.extract_text()
pinocchio.tokenize()
print pinocchio.title
sweep_values = lexical_sweep(pinocchio.tokens, samples=100, log_x=False, log_y=False)
with open('pinocchio_sweep.tsv', 'w') as my_file:
    for sweep_value in sweep_values:
        my_file.write(str(sweep_value[0]) + "\t" + str(sweep_value[1]) + "\n")
#+END_SRC

#+RESULTS: pinocchio_sweep
: The Adventures of Pinocchio
* SQL DB
#+header: :engine mysql
#+header: :dbuser root
#+header: :dbpassword root
#+header: :database fiction
#+begin_src sql
SELECT DISTINCT Language FROM main;
#+end_src

#+RESULTS:
| Tables_in_fiction |
|-------------------|
| hashes            |
| main              |
| main_edited       |

#+NAME: db-connection
#+begin_src python :noweb yes :session python :exports code
MY_DB = mysql.connector.connect(
    host="localhost",
    user="root",
    passwd="root",
    charset='utf8'
)
#+end_src

#+Name: database-insertion
#+begin_src python :noweb yes :session python :exports code
def insert_book_db(book, word_curve_fit, zh_character_curve_fit, db="library"):
    '''
    Insert data into db
    '''
    mycursor = MY_DB.cursor()
    mycursor.execute("use " + db + ";")
    sql = """INSERT IGNORE corpus (title,
    author,
    slope,
    intercept,
    std_error_slope,
    std_error_intercept,
    word_count,
    unique_words,
    zhslope,
    zhintercept,
    zhstd_error_slope,
    zhstd_error_intercept,
    character_count,
    unique_characters,
    language,
    epub_type,
    subject,
    source,
    rights,
    relation,
    publisher,
    identifier,
    epub_format,
    description,
    contributor,
    date
    ) VALUES (%s,
    %s,
    %s,
    %s,
    %s,
    %s,
    %s,
    %s,
    %s,
    %s,
    %s,
    %s,
    %s,
    %s,
    %s,
    %s,
    %s,
    %s,
    %s,
    %s,
    %s,
    %s,
    %s,
    %s,
    %s,
    %s)"""
    val = (book.title,
           book.author,
           float(word_curve_fit['slope']),
           float(word_curve_fit['intercept']),
           float(word_curve_fit['std_error_slope']),
           float(word_curve_fit['std_error_intercept']),
           float(book.word_count),
           float(book.unique_words),
           float(zh_character_curve_fit['slope']),
           float(zh_character_curve_fit['intercept']),
           float(zh_character_curve_fit['std_error_slope']),
           float(zh_character_curve_fit['std_error_intercept']),
           float(book.character_count),
           float(book.unique_characters),
           book.language,
           book.epub_type,
           book.subject,
           book.source,
           book.rights,
           book.relation,
           book.publisher,
           book.identifier,
           book.epub_format,
           book.description,
           book.contributor,
           book.date)
    mycursor.execute(sql, val)
    MY_DB.commit()
    print("1 record inserted, ID:", mycursor.lastrowid)
#+end_src

#+RESULTS:
#+Name: database-creation
#+begin_src python :noweb yes :session python :exports code
def create_database(db="library"):
    '''
    Create database if it doesn't exists yet.
    '''
    mycursor = MY_DB.cursor()
    mycursor.execute("CREATE DATABASE IF NOT EXISTS " + db + ";")
    mycursor.execute(
        "ALTER DATABASE " + db + " CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci;")
    mycursor.execute("USE " + db + ";")
    mycursor.execute(
        """ CREATE TABLE IF NOT EXISTS corpus (id INT AUTO_INCREMENT PRIMARY KEY,
        title VARCHAR(255),
        author VARCHAR(255),
        slope DECIMAL(10,5),
        intercept DECIMAL(10,5),
        std_error_slope DECIMAL(10,5),
        std_error_intercept DECIMAL(10,5),
        word_count DECIMAL(20,1),
        unique_words DECIMAL(20,1),
        zhslope DECIMAL(10,5),
        zhintercept DECIMAL(10,5),
        zhstd_error_slope DECIMAL(10,5),
        zhstd_error_intercept DECIMAL(10,5),
        character_count DECIMAL(15,1),
        unique_characters DECIMAL(15,1),
        language VARCHAR(255),
        epub_type VARCHAR(255),
        subject VARCHAR(255),
        source VARCHAR(255),
        rights VARCHAR(255),
        relation VARCHAR(255),
        publisher VARCHAR(255),
        identifier VARCHAR(255),
        epub_format VARCHAR(255),
        description VARCHAR(510),
        contributor VARCHAR(255),
        date VARCHAR(255)) """)
    mycursor.execute(
        "ALTER TABLE corpus CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci;")
    try:
        mycursor.execute(
            "ALTER TABLE corpus ADD CONSTRAINT unique_book UNIQUE (title,author);")
    except Exception as ex:
        print ex
#+end_src

#+NAME: is-book-in-db
#+begin_src python :noweb yes :session python :exports code :results output
def is_book_in_db(title, author):
    '''
    Check if book is in database.
    '''
    mycursor = MY_DB.cursor()
    mycursor.execute("CREATE DATABASE IF NOT EXISTS library;")
    mycursor.execute("USE library;")
    query = ('SELECT * from corpus where title="' + str(title)
             + '" and author="' + str(author) + '"')
    mycursor.execute(query)
    mycursor.fetchall()
    if mycursor.rowcount == 1:
        print ("Book " + str(title)
               + ", by " + str(author)
               + " already in database. Next.")
        return True
    return False
#+end_src

#+RESULTS: does-book-exist-db
: ELECT * from corpus where title="opus" and author="paco"
: 1
: Book opus, by paco already in database. Next.
#+NAME: db-backup
#+begin_src python :noweb yes :session python :exports code
def runbackup(hostname,
              mysql_user,
              mysql_password,
              db_loc="test/db/library_test.db"):
    '''
    Write sql file.
    '''
    try:
        backup = subprocess.Popen("mysqldump -h"
                                  + hostname + " -u"
                                  + mysql_user + " -p'"
                                  + mysql_password + "' --databases library > "
                                  + db_loc, shell=True)
        # Wait for completion
        backup.communicate()
        if backup.returncode != 0:
            sys.exit(1)
        else:
            print("Backup done for", hostname)
    except Exception as ex:
        # Check for errors
        print ex
        print("Backup failed for", hostname)
#+end_src
* Tagging
  The purpose of this section is to tag the lists containing the analysis with the canon to which they belong, if appropriate.
  #+begin_src bash :tangle canon-tagging.sh :exports code
canon="/home/rcl/readability-metric/canon/chinese.txt"
analized="/home/rcl/readability-metric/tagging/zh-TW.tsv"
list=""
while read -r author_canon title_canon; do
        list+=$author_canon
        list+=" "
done < "$canon"
unique_authors=$(tr ' ' '\n' <<< $list | sort -u)
echo $unique_authors
while read -r filesize lexicalVariety intercept slope language author_list title_list type subject source rights relation publisher identifier format contibutor date; do
    flag=0
    while read -r author_canon title_canon; do
        if [ "$author_list" == "$author_canon" ] && [ "$title_list" == "$title_canon" ]; then
            #printf '%s %s Canon match!!\n' "$author_list" "$title_list"
            flag=1
        fi
    done < "$canon"
    for word in $unique_authors; do
        if [ "$author_list" == "$word" ] && [ "$flag" != 1 ]; then
            #printf '%s %s Extended canon match!!\n' "$author_list" "$title_list"
        fi
    done
done < "$analized"
  #+end_src

  #+begin_src bash
linewriting="/home/rcl/readability-metric/linewriting.txt"
touch $linewriting
echo "roland coeurjoly" > $linewriting
echo "chun zhang" >> $linewriting

while read line; do
    if [[ $line = *"chun zhang"* ]]; then
        #echo "substring found!"
        echo
    fi
done < "$linewriting"
less $linewriting
  #+end_src
  #+begin_src python :results output
# -*- coding: utf-8 -*-
import numpy
import csv
canon_file="/home/rcl/readability-metric/canon/chinese.txt"
analysis_file="/home/rcl/readability-metric/tagging/zh-TW.tsv"
canon = numpy.array(list(csv.reader(open(canon_file, "rb"), delimiter=" "))).astype("object")
analysis = numpy.array(list(csv.reader(open(analysis_file, "rb"), delimiter="\t"))).astype("object")
print canon[90][0]
print analysis[90][5]
  #+end_src
  #+RESULTS:
  : 古龍
  : 東野圭吾
#+begin_src python :results output
import json

with open("benchmarks.json", "r") as test_cases:
    benchmarks = json.load(test_cases)
    for benchmark in benchmarks['books']:
        print benchmark['path'].encode('utf-8')
        print benchmark['author'].encode('utf-8')
        print benchmark['title'].encode('utf-8')
        print benchmark['epub_type'].encode('utf-8')
        print benchmark['word_curve_fit_slope']
        print benchmark['zh_character_curve_fit_slope']
        print benchmark['word_count']
        print benchmark['unique_words']
#+end_src


#+RESULTS:
#+begin_example
test/pg23306.epub
René Descartes
Meditationes de prima philosophia

0.803463675366
0
28207
6085
test/pg21000.epub
Johann Wolfgang von Goethe
Faust: Eine Tragödie

0.831561333002
0
36751
9293
test/pg24264.epub
Xueqin Cao
紅樓夢

0.69794400829
373.751162525
662992
21113
test/pg6099.epub
Charles Baudelaire
Les Fleurs du Mal

0.834087803731
0
31525
8177
test/pg2000.epub
Miguel de Cervantes Saavedra
Don Quijote

0.740139477978
0
449755
27284
test/pg521.epub
Daniel Defoe
The Life and Adventures of Robinson Crusoe

0.708038727522
0
141776
7643
test/Las conversaciones privadas de Hitler - Adolf Hitler.epub
Adolf Hitler
Las conversaciones privadas de Hitler

0.774981251067
0
308320
28381
#+end_example
#+begin_src emacs-lisp
(require 'virtualenvwrapper)
(setq venv-location "/home/rcl/readability-metric/env/")
#+end_src

#+RESULTS:
: /home/rcl/readability-metric/env/

#+RESULTS:
|                 |
|                 |
| /usr/bin/python |
#+begin_src python :results output :session python
import sys
print('\n'.join(sys.path))
print(sys.executable)
#+end_src

#+RESULTS:
#+begin_example
/home/rcl/readability-metric/lib/python2.7
/home/rcl/readability-metric/lib/python2.7/plat-x86_64-linux-gnu
/home/rcl/readability-metric/lib/python2.7/lib-tk
/home/rcl/readability-metric/lib/python2.7/lib-old
/home/rcl/readability-metric/lib/python2.7/lib-dynload
/usr/lib/python2.7
/usr/lib/python2.7/plat-x86_64-linux-gnu
/usr/lib/python2.7/lib-tk
/home/rcl/readability-metric/local/lib/python2.7/site-packages
/home/rcl/readability-metric/lib/python2.7/site-packages
/home/rcl/readability-metric/bin/python
#+end_example
